backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_4, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 768, 1024, 1]
      dtype: float32
      name: input_4
      sparse: false
    inbound_nodes: []
    name: input_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id002 !!python/tuple [1, 1]
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_22
      padding: same
      strides: &id003 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_4
        - 0
        - 0
        - {}
    name: conv2d_22
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_10
      padding: same
      pool_size: &id001 !!python/tuple [2, 2]
      strides: *id001
      trainable: true
    inbound_nodes:
    - - - conv2d_22
        - 0
        - 0
        - {}
    name: max_pooling2d_10
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_23
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_23
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_11
      padding: same
      pool_size: &id004 !!python/tuple [2, 2]
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - conv2d_23
        - 0
        - 0
        - {}
    name: max_pooling2d_11
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_24
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_24
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_12
      padding: same
      pool_size: &id005 !!python/tuple [2, 2]
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_24
        - 0
        - 0
        - {}
    name: max_pooling2d_12
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_25
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_12
        - 0
        - 0
        - {}
    name: conv2d_25
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up_sampling2d_10
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_25
        - 0
        - 0
        - {}
    name: up_sampling2d_10
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 8
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_26
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - up_sampling2d_10
        - 0
        - 0
        - {}
    name: conv2d_26
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up_sampling2d_11
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_26
        - 0
        - 0
        - {}
    name: up_sampling2d_11
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_27
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - up_sampling2d_11
        - 0
        - 0
        - {}
    name: conv2d_27
  - class_name: UpSampling2D
    config:
      data_format: channels_last
      name: up_sampling2d_12
      size: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_27
        - 0
        - 0
        - {}
    name: up_sampling2d_12
  - class_name: Conv2D
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id002
      filters: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_28
      padding: same
      strides: *id003
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - up_sampling2d_12
        - 0
        - 0
        - {}
    name: conv2d_28
  name: model_4
  output_layers:
  - [conv2d_28, 0, 0]
keras_version: 2.0.3
